In [2]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
p = pd.Series([4,8,15,16,23,42])
print(p)
type(p)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [10]:
l = [1,2,3,4,5,6,7,8,9,0]
print(pd.Series(l))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female
Then, print the DataFrame.

In [11]:
data = {
'Name':['Alice','Bob','Claire'],
'Age':[25,30,27],
'Gender':['Female','Male','Female']    
}
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
The Pandas Series data structure is a one-dimensional labelled array. It is the primary building block for a DataFrame, making up its rows and columns.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Functions to manipulate data in Pandas DataFrame are : 
    Drop, merge, fillna, dropna, copy, replace.
dropna function is used to drop rows whose value is na.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame and Panel are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
p = pd.Series([1,2,3,4])
q = pd.Series([5,6,7,8])